Documents/АктСнятияПоказанийПоГВ.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.12">
	<Document>
		<Properties>
			<Name>АктСнятияПоказанийПоГВ</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>InformationRegister.АктСнятияПоказанийГорячейВоды</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЛицевойСчет</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЛицевыеСчета</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Здание</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЗданияИСооружения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПериодНачисления</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Исполнитель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Автор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Коментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АвторПоследнегоИзменения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаПоследнегоИзменения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ПоказанияПриборов</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ПриборУчета</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ПриборыУчета</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЕдиницаИзмерения</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.КлассификаторЕдиницИзмерения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВидТарифа</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ВидыТарифов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Коэффициент</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>6</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПоказаниеПредыдущее</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>5</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПоказаниеТекущее</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>5</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>РазницаПоказания</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>5</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Documents/АктСнятияПоказанийПоГВ/Ext/ManagerModule.bsl
Процедура ИнициализироватьДанныеДокумента(ДокументСсылкаАктСнятияПоказанийПоГВПоказанияПриборов, СтруктураДополнительныеСвойства) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = СтруктураДополнительныеСвойства.ДляПроведения.СтруктураВременныеТаблицы.МенеджерВременныхТаблиц;
	Запрос.Текст = 
		 "ВЫБРАТЬ
		 |	КОНЕЦПЕРИОДА(АктСнятияПоказанийПоГВПоказанияПриборов.Ссылка.ПериодНачисления, МЕСЯЦ) КАК Период,
		 |	АктСнятияПоказанийПоГВПоказанияПриборов.ПриборУчета,
		 |	АктСнятияПоказанийПоГВПоказанияПриборов.ЕдиницаИзмерения,
		 |	АктСнятияПоказанийПоГВПоказанияПриборов.ВидТарифа,
		 |	АктСнятияПоказанийПоГВПоказанияПриборов.Коэффициент,
		 |	АктСнятияПоказанийПоГВПоказанияПриборов.ПоказаниеПредыдущее,
		 |	АктСнятияПоказанийПоГВПоказанияПриборов.ПоказаниеТекущее,
		 |	АктСнятияПоказанийПоГВПоказанияПриборов.РазницаПоказания,
		 |	АктСнятияПоказанийПоГВПоказанияПриборов.Ссылка.ЛицевойСчет,
		 |	АктСнятияПоказанийПоГВПоказанияПриборов.Ссылка.Организация,
		 |	АктСнятияПоказанийПоГВПоказанияПриборов.Ссылка.Здание,
		 |	АктСнятияПоказанийПоГВПоказанияПриборов.Ссылка.Исполнитель,
		 |	АктСнятияПоказанийПоГВПоказанияПриборов.Ссылка.Автор КАК Ответственный,
		 |	АктСнятияПоказанийПоГВПоказанияПриборов.Ссылка.ПериодНачисления
		 |ИЗ
		 |	Документ.АктСнятияПоказанийПоГВ.ПоказанияПриборов КАК АктСнятияПоказанийПоГВПоказанияПриборов
		 |ГДЕ
		 |	АктСнятияПоказанийПоГВПоказанияПриборов.Ссылка = &Ссылка";
	 
	Запрос.УстановитьПараметр("Ссылка", ДокументСсылкаАктСнятияПоказанийПоГВПоказанияПриборов);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	СтруктураДополнительныеСвойства.ТаблицыДляДвижений.Вставить("ТаблицаПоказанияПриборовУчета", РезультатЗапроса.Выгрузить());
	
КонецПроцедуры

Процедура Печать(МассивОбъектов,
	ПараметрыПечати,
	КоллекцияПечатныхФорм,
	ОбъектыПечати,
	ПараметрыВывода) Экспорт
	
	ПараметрыВывода.ДоступнаПечатьПоКомплектно = Истина;
	
	Если УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "АктГВС") Тогда
		УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(КоллекцияПечатныхФорм, "АктГВС", "АктГВС", ПечатьДокумента(МассивОбъектов, ОбъектыПечати, "АктГВС"));
	КонецЕсли;	
	
КонецПроцедуры

Функция ПечатьДокумента(ТекущийДокумент, ОбъектыПечати, ИмяМакета)
	ТабличныйДокумент = Новый ТабличныйДокумент;
	ТабличныйДокумент.КлючПараметровПечати = "ПараметрыПечати_АктГВС";
	
	Запрос = Новый Запрос();
	Запрос.Текст =
	    "ВЫБРАТЬ
	    |	АктСнятияПоказанийПоГВПоказанияПриборов.ПриборУчета,
	    |	АктСнятияПоказанийПоГВПоказанияПриборов.ПоказаниеПредыдущее,
	    |	АктСнятияПоказанийПоГВПоказанияПриборов.ПоказаниеТекущее,
	    |	АктСнятияПоказанийПоГВПоказанияПриборов.РазницаПоказания,
	    |	АктСнятияПоказанийПоГВПоказанияПриборов.Ссылка.Организация КАК Организация,
	    |	АктСнятияПоказанийПоГВПоказанияПриборов.Ссылка.Здание КАК Здание,
	    |	АктСнятияПоказанийПоГВПоказанияПриборов.Ссылка.ПериодНачисления,
	    |	АктСнятияПоказанийПоГВПоказанияПриборов.Ссылка.Исполнитель,
	    |	АктСнятияПоказанийПоГВПоказанияПриборов.Ссылка.Дата
	    |ИЗ
	    |	Документ.АктСнятияПоказанийПоГВ.ПоказанияПриборов КАК АктСнятияПоказанийПоГВПоказанияПриборов
	    |ГДЕ
	    |	АктСнятияПоказанийПоГВПоказанияПриборов.Ссылка = &Ссылка
	    |	И АктСнятияПоказанийПоГВПоказанияПриборов.Ссылка.ПометкаУдаления = ЛОЖЬ";
	Запрос.УстановитьПараметр("Ссылка", ТекущийДокумент);
	Макет = ПолучитьМакет("АктГВС");
	Результат = Запрос.Выполнить();
	Выборка = Результат.Выбрать();
	ОбластьДокумента = Макет.ПолучитьОбласть("ОбластьШапка");
    Выборка.Следующий();
	
	ОбластьДокумента.Параметры.Адрес = Выборка.Здание;
	ОбластьДокумента.Параметры.Дата = Выборка.Дата;
	ОбластьДокумента.Параметры.НомерСчетчика = Выборка.ПриборУчета;
	ОбластьДокумента.Параметры.ВодомерПосл = Выборка.ПоказаниеПредыдущее;
	ОбластьДокумента.Параметры.Водомер = Выборка.ПоказаниеТекущее;
	ОбластьДокумента.Параметры.ВодомерРазница = Выборка.РазницаПоказания;
	ОбластьДокумента.Параметры.ПредставительОрганизации = Выборка.Исполнитель;
	ОбластьДокумента.Параметры.Организация = Выборка.Организация;
	ТабличныйДокумент.Вывести(ОбластьДокумента);
	ТабличныйДокумент.АвтоМасштаб = Истина;
	
	Возврат ТабличныйДокумент;
КонецФункции
